[
    {
        "_id": 1,
        "chefPicture": "https://res.cloudinary.com/dpeoxmblg/image/upload/c_limit,f_jpg,fl_lossy.any_format.preserve_transparency.progressive,h_1600,pg_1,q_auto,w_1600/v1/assets/Chef/wcu3hkqadpze9rfebdad",
        "chefName": "Emr Yılmaz",
        "bio": "Emr Yılmaz is a rising star in the Turkish culinary scene, known for his innovative take on traditional Turkish dishes. He has worked in several high-end restaurants across Istanbul and is currently the head chef at the acclaimed restaurant, Nicole.",
        "yearsOfExperience": "12 years",
        "numberOfRecipes": 75,
        "likes": 350,
        "viewRecipesButton": "View Recipes",
        "recipes": [
            {
                "name": "Turkish Lentil Soup",
                "ingredients": [
                    "red lentils",
                    "onion",
                    "carrots",
                    "potatoes",
                    "tomato paste",
                    "butter"
                ],
                "method": "Rinse the red lentils in cold water. In a pot, sauté chopped onion and grated carrots in butter until soft.   Add diced potatoes, tomato paste, and rinsed lentils to the pot. Add water, salt, and pepper to taste. Bring to a boil, then reduce heat and simmer until the lentils are cooked and the soup thickens. Serve hot with a slice of lemon and bread on the side.",
                "rating": 4.6,
                "isFavorite": true
            },
            {
                "name": "Turkish Meatballs",
                "ingredients": [
                    "ground beef",
                    "onion",
                    "breadcrumbs",
                    "egg",
                    "parsley",
                    "salt"
                ],
                "method": "1. In a bowl, mix together the ground beef, chopped onion, breadcrumbs, beaten egg, finely chopped parsley, salt, and pepper.   Knead the mixture until well combined.   Form the mixture into small meatballs. Heat vegetable oil in a pan and fry the meatballs until browned on all sides. Serve hot with mashed potatoes and a side salad.",
                "rating": 4.2,
                "isFavorite": false
            },
            {
                "name": "Turkish Baklava",
                "ingredients": [
                    "phyllo dough",
                    "walnuts",
                    "sugar",
                    "water",
                    "lemon juice",
                    "butter"
                ],
                "method": "1. Preheat the oven to 180°C.   Grind the walnuts and sugar together in a food processor until finely ground.   Melt the butter in a small saucepan. Layer 6-8 sheets of phyllo dough on a baking tray, brushing each sheet with melted butter. Spread the walnut mixture evenly over the phyllo dough. Layer another 6-8 sheets of phyllo dough on top, brushing each sheet with melted butter. \\n7. Cut the baklava into diamond-shaped pieces. \\n8. Bake for 30-35 minutes, or until golden brown. \\n9. Meanwhile, make the syrup by combining water, sugar, and lemon juice in a small saucepan. \\n10. Bring the mixture to a boil, then reduce heat and simmer for 10 minutes. \\n11. Pour the syrup over the hot baklava. \\n12. Allow the baklava to cool before serving.",
                "rating": 4.8,
                "isFavorite": true
            }
        ]
    },
    {
        "_id": 2,
        "chefPicture": "https://res.cloudinary.com/dpeoxmblg/image/upload/c_limit,f_jpg,fl_lossy.any_format.preserve_transparency.progressive,h_1600,pg_1,q_auto,w_1600/v1/assets/Chef/obqm9oyjzmu14knybsop",
        "chefName": "Ali Öztürk",
        "bio": "Ali Öztürk is a renowned Turkish chef with over 20 years of experience in the industry. He is the owner and head chef at Ali Ocakbaşı, a popular restaurant in Istanbul known for its authentic Turkish cuisine.",
        "yearsOfExperience": "10 years",
        "numberOfRecipes": 50,
        "likes": 105,
        "viewRecipesButton": "View Recipes",
        "recipes": [
            {
                "name": "Turkish Lentil Soup",
                "ingredients": [
                    "red lentils",
                    "onion",
                    "carrots",
                    "potatoes",
                    "tomato paste",
                    "butter"
                ],
                "method": "1. Rinse the lentils in cold water and drain.   In a pot, sauté chopped onions in butter until they are soft.   Add diced carrots and potatoes to the pot and cook for 5 minutes. Add the lentils and enough water to cover them by about 2 inches. Bring to a boil, then reduce heat and simmer for about 20-25 minutes until the lentils are cooked. Stir in tomato paste and spices, and cook for a few minutes more. \\n7. Serve hot with crusty bread.",
                "rating": 4.7,
                "isFavorite": true
            },
            {
                "name": "Turkish Lamb Kebabs",
                "ingredients": [
                    "ground lamb",
                    "onion",
                    "garlic",
                    "red pepper flakes",
                    "cumin",
                    "paprika"
                ],
                "method": "1. In a large bowl, mix the ground lamb, chopped onion, minced garlic, red pepper flakes, cumin, paprika, and salt until well combined.   Shape the meat mixture into small patties or balls.   Preheat a grill or grill pan over medium-high heat. Grill the kebabs for 4-5 minutes on each side until cooked through. Squeeze some lemon juice over the kebabs before serving.",
                "rating": 4.4,
                "isFavorite": false
            },
            {
                "name": "Turkish Stuffed Grape Leaves",
                "ingredients": [
                    "grape leaves",
                    "rice",
                    "onion",
                    "parsley",
                    "mint",
                    "olive oil",
                    "lemon juice"
                ],
                "method": "1. Rinse the grape leaves and pat them dry.   In a bowl, mix together cooked rice, chopped onion, parsley, mint, olive oil, lemon juice, and spices.   Lay a grape leaf flat on a work surface and spoon a small amount of the rice mixture onto it. Roll the leaf up tightly, tucking in the sides as you go. Repeat with the remaining grape leaves and rice mixture. Place the stuffed grape leaves in a pot, seam side down, and pour in enough water to cover them. \\n7. Cover the pot and simmer for about 30-35 minutes until the rice is cooked and the grape leaves are tender. \\n8. Serve warm or at room temperature.",
                "rating": 4.6,
                "isFavorite": false
            }
        ]
    },
    {
        "_id": 3,
        "chefPicture": "https://res.cloudinary.com/dpeoxmblg/image/upload/c_limit,f_jpg,fl_lossy.any_format.preserve_transparency.progressive,h_1600,pg_1,q_auto,w_1600/v1/assets/Chef/abc4zj9ckoeoe2fxrgkc",
        "chefName": "Burak Kaya",
        "bio": "Burak Kaya is a celebrity chef in Turkey, known for his appearances on various cooking shows and his innovative take on traditional Turkish cuisine. He is the owner of the restaurant, Kebapçı Burak, which has several locations across Istanbul.",
        "yearsOfExperience": "15 years",
        "numberOfRecipes": 80,
        "likes": 450,
        "viewRecipesButton": "View Recipes",
        "recipes": [
            {
                "name": "Turkish Pide",
                "ingredients": [
                    "flour",
                    "yeast",
                    "water",
                    "salt",
                    "ground beef",
                    "tomatoes"
                ],
                "method": "1. Combine flour, yeast, water, and salt in a mixing bowl to make dough. \n2. Let the dough rest for an hour. \n3. Preheat the oven to 220°C. \n4. In a pan, cook ground beef with chopped tomatoes, green peppers, and onion. \n5. Roll out the dough into an oval shape and spread olive oil on top. \n6. Add the cooked beef mixture on top of the dough. \n7. Sprinkle red pepper flakes on top. \n8. Bake in the oven for 15-20 minutes. \n9. Serve hot.",
                "rating": 4.6,
                "isFavorite": true
            },
            {
                "name": "Lahmacun",
                "ingredients": [
                    "ground beef",
                    "tomatoes",
                    "onion",
                    "parsley",
                    "red pepper flakes",
                    "paprika"
                ],
                "method": "1. Combine flour, yeast, water, and salt in a mixing bowl to make dough. \n2. Let the dough rest for an hour. \n3. In a separate bowl, mix ground beef with chopped tomatoes, onion, parsley, red pepper flakes, paprika, and salt. \n4. Preheat the oven to 250°C. \n5. Roll out the dough into thin circles. \n6. Spread olive oil on top of each circle. \n7. Add the meat mixture on top of each circle. \n8. Bake in the oven for 10-15 minutes. \n9. Serve hot.",
                "rating": 4.4,
                "isFavorite": false
            },
            {
                "name": "Baklava",
                "ingredients": [
                    "phyllo dough",
                    "butter",
                    "walnuts",
                    "sugar",
                    "water",
                    "lemon juice"
                ],
                "method": "1. Preheat the oven to 180°C. \n2. Melt butter and brush it on phyllo dough sheets. \n3. Add crushed walnuts and sugar on top of each sheet. \n4. Roll up the sheets tightly and place them in a baking dish. \n5. Cut the rolled dough into diamond shapes. \n6. Bake in the oven for 25-30 minutes. \n7. In a separate saucepan, mix water, sugar, and lemon juice and bring to a boil. \n8. Pour the hot syrup over the baked baklava. \n9. Let it cool and serve.",
                "rating": 4.9,
                "isFavorite": true
            }
        ]
    },
    {
        "_id": 4,
        "chefPicture": "https://res.cloudinary.com/dpeoxmblg/image/upload/c_limit,f_jpg,fl_lossy.any_format.preserve_transparency.progressive,h_1600,pg_1,q_auto,w_1600/v1/assets/Chef/q8ajeep7nedsi9czqgh6",
        "chefName": "Caer Şahin",
        "bio": "Caer Şahin is a young and talented chef who has made a name for himself in the Turkish culinary scene. He is the head chef at the popular restaurant, Neolokal, located in Istanbul, which focuses on modern Turkish cuisine.",
        "yearsOfExperience": "8 years",
        "numberOfRecipes": 45,
        "likes": 150,
        "viewRecipesButton": "View Recipes",
        "recipes": [
            {
                "name": "Turkish Meatballs",
                "ingredients": [
                    "ground beef",
                    "bread crumbs",
                    "onion",
                    "egg",
                    "garlic",
                    "salt"
                ],
                "method": "1. In a mixing bowl, combine ground beef, bread crumbs, grated onion, minced garlic, salt, and pepper. \n2. Add beaten egg to the mixture and mix well. \n3. Form the mixture into meatballs. \n4. Heat oil in a pan and cook meatballs until browned on all sides. \n5. Serve hot with tomato sauce and rice.",
                "rating": 4.6,
                "isFavorite": true
            },
            {
                "name": "Lentil Soup",
                "ingredients": [
                    "red lentils",
                    "onion",
                    "carrot",
                    "potatoes",
                    "tomatoes",
                    "olive oil"
                ],
                "method": "1. In a pot, sauté chopped onion in olive oil until soft. \n2. Add chopped carrot and potato and cook for a few minutes. \n3. Add chopped tomatoes and red lentils to the pot and pour enough water to cover the ingredients. \n4. Cook until the lentils are tender. \n5. Use an immersion blender to blend the soup until smooth. \n6. Add salt to taste. \n7. Serve hot with bread.",
                "rating": 4.3,
                "isFavorite": false
            },
            {
                "name": "Turkish Baklava",
                "ingredients": [
                    "phyllo pastry",
                    "walnuts",
                    "sugar",
                    "water",
                    "lemon juice",
                    "butter"
                ],
                "method": "1. In a mixing bowl, mix chopped walnuts and sugar. \n2. Melt butter in a pan. \n3. Brush a baking dish with melted butter. \n4. Layer phyllo pastry sheets in the baking dish, brushing each layer with melted butter. \n5. Spread the walnut mixture on top of the phyllo layers. \n6. Add another layer of phyllo pastry sheets, brushing each layer with melted butter. \n7. Bake the baklava in the oven at 180°C for 30 minutes. \n8. In a pot, mix water, sugar, and lemon juice and bring to a boil. \n9. Pour the syrup on top of the hot baklava. \n10. Let the baklava cool down and serve.",
                "rating": 4.9,
                "isFavorite": true
            }
        ]
    },
    {
        "_id": 5,
        "chefPicture": "https://res.cloudinary.com/dpeoxmblg/image/upload/v1683015818/assets/Chef/rumarstol1vqlcskejuc.jpg",
        "chefName": "Sran Aksoy",
        "bio": "Sran Aksoy is a well-known Turkish chef who has worked in several high-end restaurants across Turkey and Europe. He is the head chef at Mikla, a Michelin-starred restaurant located in Istanbul, known for its fusion of Turkish and Scandinavian cuisine.",
        "yearsOfExperience": "5 years",
        "numberOfRecipes": 55,
        "likes": 232,
        "viewRecipesButton": "View Recipes",
        "recipes": [
            {
                "name": "Turkish Meatballs",
                "ingredients": [
                    "ground beef",
                    "onion",
                    "bread crumbs",
                    "egg",
                    "garlic",
                    "parsley"
                ],
                "method": "1. In a bowl, combine ground beef, chopped onion, bread crumbs, egg, minced garlic, chopped parsley, salt, and pepper. \n2. Mix well and form into small balls. \n3. Heat a pan with a little oil and cook the meatballs until browned on all sides. \n4. Serve hot with tomato sauce and rice.",
                "rating": 4.6,
                "isFavorite": true
            },
            {
                "name": "Stuffed Eggplant",
                "ingredients": [
                    "eggplant",
                    "ground beef",
                    "onion",
                    "tomatoes",
                    "green peppers",
                    "garlic"
                ],
                "method": "1. Cut the top off the eggplants and scoop out the flesh. \n2. In a pan, sauté chopped onion and minced garlic in olive oil until soft. \n3. Add ground beef, chopped tomatoes, sliced green peppers, salt, and pepper. Cook until meat is browned. \n4. Stuff the eggplants with the meat mixture and place in a baking dish. \n5. Bake in the oven at 350°F for 30-40 minutes. \n6. Serve hot.",
                "rating": 4.4,
                "isFavorite": false
            },
            {
                "name": "Baklava",
                "ingredients": [
                    "phyllo dough",
                    "walnuts",
                    "sugar",
                    "water",
                    "lemon juice",
                    "butter"
                ],
                "method": "1. Preheat the oven to 350°F. \n2. In a bowl, mix chopped walnuts, sugar, and cinnamon. \n3. Melt butter in a saucepan. \n4. Lay a sheet of phyllo dough on a baking sheet and brush with melted butter. \n5. Repeat with several more layers of phyllo dough, brushing each layer with melted butter. \n6. Spread the walnut mixture on top of the phyllo dough layers. \n7. Cover with more layers of phyllo dough, brushing each layer with melted butter. \n8. Cut into diamond shapes. \n9. Bake in the oven for 30-35 minutes. \n10. In a saucepan, mix water, sugar, and lemon juice. Heat until the sugar dissolves. \n11. Pour the syrup over the baklava as soon as it comes out of the oven. \n12. Let cool and serve.",
                "rating": 4.9,
                "isFavorite": true
            }
        ]
    },
    {
        "_id": 6,
        "chefPicture": "https://res.cloudinary.com/dpeoxmblg/image/upload/c_limit,f_jpg,fl_lossy.any_format.preserve_transparency.progressive,h_1600,pg_1,q_auto,w_1600/v1/assets/Chef/mcxsuu7akna31eae0jfb",
        "chefName": "Usuf Ayın",
        "bio": "Usuf Aydın is a celebrated Turkish chef who has won numerous awards for his innovative take on traditional Turkish cuisine. He is the head chef at the restaurant, Köşebaşı, which has several locations across Turkey and specializes in Turkish meat dishes.",
        "yearsOfExperience": "9 years",
        "numberOfRecipes": 65,
        "likes": 301,
        "viewRecipesButton": "View Recipes",
        "recipes": [
            {
                "name": "Turkish Lentil Soup",
                "ingredients": [
                    "red lentils",
                    "onion",
                    "carrots",
                    "potatoes",
                    "tomato paste",
                    "butter"
                ],
                "method": "1. Rinse red lentils in cold water and drain. \n2. In a pot, melt butter and sauté chopped onion until soft. \n3. Add chopped carrots, potatoes, and drained lentils to the pot. \n4. Add water to the pot, enough to cover the ingredients. \n5. Cook until the lentils and vegetables are tender. \n6. Add tomato paste and season with salt, black pepper, and red pepper flakes. \n7. Puree the soup with an immersion blender until smooth. \n8. Serve hot with bread or croutons.",
                "rating": 4.6,
                "isFavorite": true
            },
            {
                "name": "Lahmacun",
                "ingredients": [
                    "ground beef",
                    "tomatoes",
                    "onion",
                    "parsley",
                    "red pepper flakes",
                    "paprika"
                ],
                "method": "1. In a bowl, mix flour, yeast, salt, and water to make the dough. \n2. Knead the dough until smooth and let it rest for 30 minutes. \n3. In a separate bowl, mix ground beef, chopped tomatoes, onion, parsley, red pepper flakes, paprika, cumin, and olive oil to make the topping. \n4. Preheat the oven to 450°F. \n5. Divide the dough into small balls and roll them out into thin circles. \n6. Spread the topping on each circle and bake in the oven for 10-15 minutes. \n7. Serve hot with lemon wedges.",
                "rating": 4.9,
                "isFavorite": false
            },
            {
                "name": "Turkish Delight",
                "ingredients": [
                    "cornstarch",
                    "sugar",
                    "water",
                    "rosewater",
                    "food coloring",
                    "powdered sugar"
                ],
                "method": "1. In a pot, mix cornstarch, sugar, and water. \n2. Cook the mixture over medium heat, stirring constantly, until it thickens. \n3. Add rosewater and food coloring to the mixture and stir well. \n4. Pour the mixture into a square pan and let it cool. \n5. Dust powdered sugar on top of the cooled mixture. \n6. Cut the mixture into small cubes and serve.",
                "rating": 4.2,
                "isFavorite": false
            }
        ]
    }
]